const ASCII = [
  {
    b2: "0000 0000",
    b8: "00",
    b10: "0",
    b16: "0x00",
    summ: 'NUL(null)',
    expl: '空字符'
  },
  {
    b2: "0000 0001",
    b8: "01",
    b10: "1",
    b16: "0x01",
    summ: 'SOH(start of headline)',
    expl: '标题开始'
  },
  {
    b2: "0000 0010",
    b8: "02",
    b10: "2",
    b16: "0x02",
    summ: 'STX (start of text)',
    expl: '正文开始'
  },
  {
    b2: "0000 0011",
    b8: "03",
    b10: "3",
    b16: "0x03",
    summ: 'ETX (end of text)',
    expl: '正文结束'
  },
  {
    b2: "0000 0100",
    b8: "04",
    b10: "4",
    b16: "0x04",
    summ: "EOT (end of transmission)",
    expl: "传输结束"
  },
  {
    b2: "0000 0101",
    b8: "05",
    b10: "5",
    b16: "0x05",
    summ: "ENQ (enquiry)",
    expl: "请求"
  },
  {
    b2: "0000 0110",
    b8: "06",
    b10: "6",
    b16: "0x06",
    summ: "ACK (acknowledge)",
    expl: "收到通知"
  },
  {
    b2: "0000 0111",
    b8: "07",
    b10: "7",
    b16: "0x07",
    summ: "BEL (bell)",
    expl: "响铃"
  },
  {
    b2: "0000 1000",
    b8: "010",
    b10: "8",
    b16: "0x08",
    summ: "BS (backspace)",
    expl: "退格"
  },
  {
    b2: "0000 1001",
    b8: "011",
    b10: "9",
    b16: "0x09",
    summ: "HT (horizontal tab)",
    expl: "水平制表符"
  },
  {
    b2: "0000 1010",
    b8: "012",
    b10: "10",
    b16: "0x0A",
    summ: "LF (NL line feed, new line)",
    expl: "换行键"
  },
  {
    b2: "0000 1011",
    b8: "013",
    b10: "11",
    b16: "0x0B",
    summ: "VT (vertical tab)",
    expl: "垂直制表符"
  },
  {
    b2: "0000 1100",
    b8: "014",
    b10: "12",
    b16: "0x0C",
    summ: "FF (NP form feed, new page)",
    expl: "	换页键"
  },
  {
    b2: "0000 1101",
    b8: "015",
    b10: "13",
    b16: "0x0D",
    summ: "CR (carriage return)",
    expl: "回车键"
  },
  {
    b2: "0000 1110",
    b8: "016",
    b10: "14",
    b16: "0x0E",
    summ: "SO (shift out)",
    expl: "不用切换"
  },
  {
    b2: "0000 1111",
    b8: "017",
    b10: "15",
    b16: "0x0F",
    summ: "SI (shift in)",
    expl: "启用切换"
  },
  {
    b2: "0001 0000",
    b8: "020",
    b10: "16",
    b16: "0x10",
    summ: "DLE (data link escape)",
    expl: "数据链路转义"
  },
  {
    b2: "0001 0001",
    b8: "021",
    b10: "17",
    b16: "0x11",
    summ: "DC1 (device control 1)",
    expl: "设备控制1"
  },
  {
    b2: "0001 0010",
    b8: "022",
    b10: "18",
    b16: "0x12",
    summ: "DC2 (device control 2)",
    expl: "设备控制2"
  },
  {
    b2: "0001 0011",
    b8: "023",
    b10: "19",
    b16: "0x13",
    summ: "DC3 (device control 3)",
    expl: "设备控制3"
  },
  {
    b2: "0001 0100",
    b8: "024",
    b10: "20",
    b16: "0x14",
    summ: "DC4 (device control 4)",
    expl: "设备控制4"
  },
  {
    b2: "0001 0101",
    b8: "025",
    b10: "21",
    b16: "0x15",
    summ: "NAK (negative acknowledge)",
    expl: "拒绝接收"
  },
  {
    b2: "0001 0110",
    b8: "026",
    b10: "22",
    b16: "0x16",
    summ: "SYN (synchronous idle)",
    expl: "同步空闲"
  },
  {
    b2: "0001 0111",
    b8: "027",
    b10: "23",
    b16: "0x17",
    summ: "ETB (end of trans. block)",
    expl: "结束传输块"
  },
  {
    b2: "0001 1000",
    b8: "030",
    b10: "24",
    b16: "0x18",
    summ: "CAN (cancel)",
    expl: "取消"
  },
  {
    b2: "0001 1001",
    b8: "031",
    b10: "25",
    b16: "0x19",
    summ: "EM (end of medium)",
    expl: "媒介结束"
  },
  {
    b2: "0001 1010",
    b8: "032",
    b10: "26",
    b16: "0x1A",
    summ: "SUB (substitute)",
    expl: "代替"
  },
  {
    b2: "0001 1011",
    b8: "033",
    b10: "27",
    b16: "0x1B",
    summ: "ESC (escape)",
    expl: "换码(溢出)"
  },
  {
    b2: "0001 1100",
    b8: "034",
    b10: "28",
    b16: "0x1C",
    summ: "FS (file separator)",
    expl: "文件分隔符"
  },
  {
    b2: "0001 1101",
    b8: "035",
    b10: "29",
    b16: "0x1D",
    summ: "GS (group separator)",
    expl: "分组符"
  },
  {
    b2: "0001 1110",
    b8: "036",
    b10: "30",
    b16: "0x1E",
    summ: "RS (record separator)",
    expl: "记录分隔符"
  },
  {
    b2: "0001 1111",
    b8: "037",
    b10: "31",
    b16: "0x1F",
    summ: "US (unit separator)",
    expl: "单元分隔符"
  },
  {
    b2: "0010 0000",
    b8: "040",
    b10: "32",
    b16: "0x20",
    summ: "(space)",
    expl: "空格"
  },
  {
    b2: "0010 0001",
    b8: "041",
    b10: "33",
    b16: "0x21",
    summ: "!",
    expl: "叹号"
  },
  {
    b2: "0010 0010",
    b8: "042",
    b10: "34",
    b16: "0x22",
    summ: `"`,
    expl: "双引号"
  },
  {
    b2: "0010 0011",
    b8: "043",
    b10: "35",
    b16: "0x23",
    summ: "#",
    expl: "井号"
  },
  {
    b2: "0010 0100",
    b8: "044",
    b10: "36",
    b16: "0x24",
    summ: "$",
    expl: "美元符"
  },
  {
    b2: "0010 0101",
    b8: "045",
    b10: "37",
    b16: "0x25",
    summ: "%",
    expl: "百分号"
  },
  {
    b2: "0010 0110",
    b8: "046",
    b10: "38",
    b16: "0x26",
    summ: "&",
    expl: "和号"
  },
  {
    b2: "0010 0111",
    b8: "047",
    b10: "39",
    b16: "0x27",
    summ: `'`,
    expl: "闭单引号"
  },
  {
    b2: "0010 1000",
    b8: "050",
    b10: "40",
    b16: "0x28",
    summ: "(",
    expl: "开括号"
  },
  {
    b2: "0010 1001",
    b8: "051",
    b10: "41",
    b16: "0x29",
    summ: ")",
    expl: "闭括号"
  },
  {
    b2: "0010 1010",
    b8: "052",
    b10: "42",
    b16: "0x2A",
    summ: "*",
    expl: "星号"
  },
  {
    b2: "0010 1011",
    b8: "053",
    b10: "43",
    b16: "0x2B",
    summ: "+",
    expl: "加号"
  },
  {
    b2: "0010 1100",
    b8: "054",
    b10: "44",
    b16: "0x2C",
    summ: ",",
    expl: "逗号"
  },
  {
    b2: "0010 1101",
    b8: "055",
    b10: "45",
    b16: "0x2D",
    summ: "-",
    expl: "减号/破折号"
  },
  {
    b2: "0010 1110",
    b8: "056",
    b10: "46",
    b16: "0x2E",
    summ: ".",
    expl: "	句号"
  },
  {
    b2: "0010 1111",
    b8: "057",
    b10: "47",
    b16: "0x2F",
    summ: "/",
    expl: "斜杠"
  },
  {
    b2: "0011 0000",
    b8: "060",
    b10: "48",
    b16: "0x30",
    summ: "0",
    expl: "字符0"
  },
  {
    b2: "0011 0001",
    b8: "061",
    b10: "49",
    b16: "0x31",
    summ: "1",
    expl: "字符1"
  },
  {
    b2: "0011 0010",
    b8: "062",
    b10: "50",
    b16: "0x32",
    summ: "2",
    expl: "字符2"
  },
  {
    b2: "0011 0011",
    b8: "063",
    b10: "51",
    b16: "0x33",
    summ: "3",
    expl: "字符3"
  },
  {
    b2: "0011 0100",
    b8: "064",
    b10: "52",
    b16: "0x34",
    summ: "4",
    expl: "字符4"
  },
  {
    b2: "0011 0101",
    b8: "065",
    b10: "53",
    b16: "0x35",
    summ: "5",
    expl: "字符5"
  },
  {
    b2: "0011 0110",
    b8: "066",
    b10: "54",
    b16: "0x36",
    summ: "6",
    expl: "字符6"
  },
  {
    b2: "0011 0111",
    b8: "067",
    b10: "55",
    b16: "0x37",
    summ: "7",
    expl: "字符7"
  },
  {
    b2: "0011 1000",
    b8: "070",
    b10: "56",
    b16: "0x38",
    summ: "8",
    expl: "字符8"
  },
  {
    b2: "0011 1001",
    b8: "071",
    b10: "57",
    b16: "0x39",
    summ: "9",
    expl: "字符9"
  },
  {
    b2: "0011 1010",
    b8: "072",
    b10: "58",
    b16: "0x3A",
    summ: ":",
    expl: "冒号"
  },
  {
    b2: "0011 1011",
    b8: "073",
    b10: "59",
    b16: "0x3B",
    summ: ";",
    expl: "	分号"
  },
  {
    b2: "0011 1100",
    b8: "074",
    b10: "60",
    b16: "0x3C",
    summ: "<",
    expl: "小于"
  },
  {
    b2: "0011 1101",
    b8: "075",
    b10: "61",
    b16: "0x3D",
    summ: "=",
    expl: "等号"
  },
  {
    b2: "0011 1110",
    b8: "076",
    b10: "62",
    b16: "0x3E",
    summ: ">",
    expl: "大于"
  },
  {
    b2: "0011 1111",
    b8: "077",
    b10: "63",
    b16: "0x3F",
    summ: "?",
    expl: "问号"
  },
  {
    b2: "0100 0000",
    b8: "0100",
    b10: "64",
    b16: "0x40",
    summ: "@",
    expl: "电子邮件符号"
  },
  {
    b2: "0100 0001",
    b8: "0101",
    b10: "65",
    b16: "0x41",
    summ: "A",
    expl: "大写字母A"
  },
  {
    b2: "0100 0010",
    b8: "0102",
    b10: "66",
    b16: "0x42",
    summ: "B",
    expl: "大写字母B"
  },
  {
    b2: "0100 0011",
    b8: "0103",
    b10: "67",
    b16: "0x43",
    summ: "C",
    expl: "大写字母C"
  },
  {
    b2: "0100 0100",
    b8: "0104",
    b10: "68",
    b16: "0x44",
    summ: "D",
    expl: "大写字母D"
  },
  {
    b2: "0100 0101",
    b8: "0105",
    b10: "69",
    b16: "0x45",
    summ: "E",
    expl: "大写字母E"
  },
  {
    b2: "0100 0110",
    b8: "0106",
    b10: "70",
    b16: "0x46",
    summ: "F",
    expl: "大写字母F"
  },
  {
    b2: "0100 0111",
    b8: "0107",
    b10: "71",
    b16: "0x47",
    summ: "G",
    expl: "大写字母G"
  },
  {
    b2: "0100 1000",
    b8: "0110",
    b10: "72",
    b16: "0x48",
    summ: "H",
    expl: "	大写字母H"
  },
  {
    b2: "0100 1001",
    b8: "0111",
    b10: "73",
    b16: "0x49",
    summ: "I",
    expl: "大写字母I"
  },
  {
    b2: "01001010",
    b8: "0112",
    b10: "74",
    b16: "0x4A",
    summ: "J",
    expl: "大写字母J"
  },
  {
    b2: "0100 1011",
    b8: "0113",
    b10: "75",
    b16: "0x4B",
    summ: "K",
    expl: "大写字母K"
  },
  {
    b2: "0100 1100",
    b8: "0114",
    b10: "76",
    b16: "0x4C",
    summ: "L",
    expl: "大写字母L"
  },
  {
    b2: "0100 1101",
    b8: "0115",
    b10: "77",
    b16: "0x4D",
    summ: "M",
    expl: "大写字母M"
  },
  {
    b2: "0100 1110",
    b8: "0116",
    b10: "78",
    b16: "0x4E",
    summ: "N",
    expl: "大写字母N"
  },
  {
    b2: "0100 1111",
    b8: "0117",
    b10: "79",
    b16: "0x4F",
    summ: "O",
    expl: "大写字母O"
  },
  {
    b2: "0101 0000",
    b8: "0120",
    b10: "80",
    b16: "0x50",
    summ: "P",
    expl: "大写字母P"
  },
  {
    b2: "0101 0001",
    b8: "0121",
    b10: "81",
    b16: "0x51",
    summ: "Q",
    expl: "大写字母Q"
  },
  {
    b2: "0101 0010",
    b8: "0122",
    b10: "82",
    b16: "0x52",
    summ: "R",
    expl: "大写字母R"
  },
  {
    b2: "0101 0011",
    b8: "0123",
    b10: "83",
    b16: "0x53",
    summ: "S",
    expl: "大写字母S"
  },
  {
    b2: "0101 0100",
    b8: "0124",
    b10: "84",
    b16: "0x54",
    summ: "T",
    expl: "大写字母T"
  },
  {
    b2: "0101 0101",
    b8: "0125",
    b10: "85",
    b16: "0x55",
    summ: "U",
    expl: "大写字母U"
  },
  {
    b2: "0101 0110",
    b8: "0126",
    b10: "86",
    b16: "0x56",
    summ: "V",
    expl: "大写字母V"
  },
  {
    b2: "0101 0111",
    b8: "0127",
    b10: "87",
    b16: "0x57",
    summ: "W",
    expl: "大写字母W"
  },
  {
    b2: "0101 1000",
    b8: "0130",
    b10: "88",
    b16: "0x58",
    summ: "X",
    expl: "大写字母X"
  },
  {
    b2: "0101 1001",
    b8: "0131",
    b10: "89",
    b16: "0x59",
    summ: "Y",
    expl: "大写字母Y"
  },
  {
    b2: "0101 1010",
    b8: "0132",
    b10: "90",
    b16: "0x5A",
    summ: "Z",
    expl: "	大写字母Z"
  },
  {
    b2: "0101 1011",
    b8: "0133",
    b10: "91",
    b16: "0x5B",
    summ: "[",
    expl: "开方括号"
  },
  {
    b2: "0101 1100",
    b8: "0134",
    b10: "92",
    b16: "0x5C",
    summ: "\\",
    expl: "反斜杠"
  },
  {
    b2: "0101 1101",
    b8: "0135",
    b10: "93",
    b16: "0x5D",
    summ: "]",
    expl: "闭方括号"
  },
  {
    b2: "0101 1110",
    b8: "0136",
    b10: "94",
    b16: "0x5E",
    summ: "^",
    expl: "脱字符"
  },
  {
    b2: "0101 1111",
    b8: "0137",
    b10: "95",
    b16: "0x5F",
    summ: "_",
    expl: "下划线"
  },
  {
    b2: "0110 0000",
    b8: "0140",
    b10: "96",
    b16: "0x60",
    summ: "`",
    expl: "开单引号"
  },
  {
    b2: "0110 0001",
    b8: "0141",
    b10: "97",
    b16: "0x61",
    summ: "a",
    expl: "小写字母a"
  },
  {
    b2: "0110 0010",
    b8: "0142",
    b10: "98",
    b16: "0x62",
    summ: "b",
    expl: "小写字母b"
  },
  {
    b2: "0110 0011",
    b8: "0143",
    b10: "99",
    b16: "0x63",
    summ: "c",
    expl: "小写字母c"
  },
  {
    b2: "0110 0100",
    b8: "0144",
    b10: "100",
    b16: "0x64",
    summ: "d",
    expl: "小写字母d"
  },
  {
    b2: "0110 0101",
    b8: "0145",
    b10: "101",
    b16: "0x65",
    summ: "e",
    expl: "小写字母e"
  },
  {
    b2: "0110 0110",
    b8: "0146",
    b10: "102",
    b16: "0x66",
    summ: "f",
    expl: "小写字母f"
  },
  {
    b2: "0110 0111",
    b8: "0147",
    b10: "103",
    b16: "0x67",
    summ: "g",
    expl: "小写字母g"
  },
  {
    b2: "0110 1000",
    b8: "0150",
    b10: "104",
    b16: "0x68",
    summ: "h",
    expl: "小写字母h"
  },
  {
    b2: "0110 1001",
    b8: "0151",
    b10: "105",
    b16: "0x69",
    summ: "i",
    expl: "小写字母i"
  },
  {
    b2: "0110 1010",
    b8: "0152",
    b10: "106",
    b16: "0x6A",
    summ: "j",
    expl: "小写字母j"
  },
  {
    b2: "0110 1011",
    b8: "0153",
    b10: "107",
    b16: "0x6B",
    summ: "k",
    expl: "小写字母k"
  },
  {
    b2: "0110 1100",
    b8: "0154",
    b10: "108",
    b16: "0x6C",
    summ: "l",
    expl: "小写字母l"
  },
  {
    b2: "0110 1101",
    b8: "0155",
    b10: "109",
    b16: "0x6D",
    summ: "m",
    expl: "小写字母m"
  },
  {
    b2: "0110 1110",
    b8: "0156",
    b10: "110",
    b16: "0x6E",
    summ: "n",
    expl: "小写字母n"
  },
  {
    b2: "0110 1111",
    b8: "0157",
    b10: "111",
    b16: "0x6F",
    summ: "o",
    expl: "小写字母o"
  },
  {
    b2: "0111 0000",
    b8: "0160",
    b10: "112",
    b16: "0x70",
    summ: "p",
    expl: "小写字母p"
  },
  {
    b2: "0111 0001",
    b8: "0161",
    b10: "113",
    b16: "0x71",
    summ: "q",
    expl: "小写字母q"
  },
  {
    b2: "0111 0010",
    b8: "0162",
    b10: "114",
    b16: "0x72",
    summ: "r",
    expl: "小写字母r"
  },
  {
    b2: "0111 0011",
    b8: "0163",
    b10: "115",
    b16: "0x73",
    summ: "s",
    expl: "小写字母s"
  },
  {
    b2: "0111 0100",
    b8: "0164",
    b10: "116",
    b16: "0x74",
    summ: "t",
    expl: "小写字母t"
  },
  {
    b2: "0111 0101",
    b8: "0165",
    b10: "117",
    b16: "0x75",
    summ: "u",
    expl: "小写字母u"
  },
  {
    b2: "0111 0110",
    b8: "0166",
    b10: "118",
    b16: "0x76",
    summ: "v",
    expl: "小写字母v"
  },
  {
    b2: "0111 0111",
    b8: "0167",
    b10: "119",
    b16: "0x77",
    summ: "w",
    expl: "小写字母w"
  },
  {
    b2: "0111 1000",
    b8: "0170",
    b10: "120",
    b16: "0x78",
    summ: "x",
    expl: "小写字母x"
  },
  {
    b2: "0111 1001",
    b8: "0171",
    b10: "121",
    b16: "0x79",
    summ: "y",
    expl: "小写字母y"
  },
  {
    b2: "0111 1010",
    b8: "0172",
    b10: "122",
    b16: "0x7A",
    summ: "z",
    expl: "小写字母z"
  },
  {
    b2: "0111 1011",
    b8: "0173",
    b10: "123",
    b16: "0x7B",
    summ: "{",
    expl: "开花括号"
  },
  {
    b2: "0111 1100",
    b8: "0174",
    b10: "124",
    b16: "0x7C",
    summ: "|",
    expl: "垂线"
  },
  {
    b2: "0111 1101",
    b8: "0175",
    b10: "125",
    b16: "0x7D",
    summ: "}",
    expl: "闭花括号"
  },
  {
    b2: "0111 1110",
    b8: "0176",
    b10: "126",
    b16: "0x7E",
    summ: "~",
    expl: "波浪号"
  },
  {
    b2: "0111 1111",
    b8: "0177",
    b10: "127",
    b16: "0x7F",
    summ: "DEL (delete)",
    expl: "删除"
  },
]

 export default ASCII
