const ASCII = [
  {
    b2: "0000 0000",
    b8: "00",
    b10: "0",
    b16: "0x00",
    summ: 'NUL(null)',
    expl: '空字符'
  },
  {
    b2: "0000 0001",
    b8: "01",
    b10: "1",
    b16: "0x01",
    summ: 'SOH(start of headline)',
    expl: '标题开始'
  },
  {
    b2: "0000 0010",
    b8: "02",
    b10: "2",
    b16: "0x02",
    summ: 'STX (start of text)',
    expl: '正文开始'
  },
  {
    b2: "0000 0011",
    b8: "03",
    b10: "3",
    b16: "0x03",
    summ: 'ETX (end of text)',
    expl: '正文结束'
  },
  {
    b2: "0000 0100",
    b8: "04",
    b10: "4",
    b16: "0x04",
    summ: "EOT (end of transmission)",
    expl: "传输结束"
  },
  {
    b2: "0000 0101",
    b8: "05",
    b10: "5",
    b16: "0x05",
    summ: "ENQ (enquiry)",
    expl: "请求"
  },
  {
    b2: "0000 0110",
    b8: "06",
    b10: "6",
    b16: "0x06",
    summ: "ACK (acknowledge)",
    expl: "收到通知"
  },
  {
    b2: "0000 0111",
    b8: "07",
    b10: "7",
    b16: "0x07",
    summ: "BEL (bell)",
    expl: "响铃"
  },
  {
    b2: "0000 1000",
    b8: "010",
    b10: "8",
    b16: "0x08",
    summ: "BS (backspace)",
    expl: "退格"
  },
  {
    b2: "0000 1001",
    b8: "011",
    b10: "9",
    b16: "0x09",
    summ: "HT (horizontal tab)",
    expl: "水平制表符"
  },
  {
    b2: "0000 1010",
    b8: "012",
    b10: "10",
    b16: "0x0A",
    summ: "LF (NL line feed, new line)",
    expl: "换行键"
  },
  {
    b2: "0000 1011",
    b8: "013",
    b10: "11",
    b16: "0x0B",
    summ: "VT (vertical tab)",
    expl: "垂直制表符"
  },
  {
    b2: "0000 1100",
    b8: "014",
    b10: "12",
    b16: "0x0C",
    summ: "FF (NP form feed, new page)",
    expl: "	换页键"
  },
  {
    b2: "0000 1101",
    b8: "015",
    b10: "13",
    b16: "0x0D",
    summ: "CR (carriage return)",
    expl: "回车键"
  },
  {
    b2: "0000 1110",
    b8: "016",
    b10: "14",
    b16: "0x0E",
    summ: "SO (shift out)",
    expl: "不用切换"
  },
  {
    b2: "0000 1111",
    b8: "017",
    b10: "15",
    b16: "0x0F",
    summ: "SI (shift in)",
    expl: "启用切换"
  },
  {
    b2: "0001 0000",
    b8: "020",
    b10: "16",
    b16: "0x10",
    summ: "DLE (data link escape)",
    expl: "数据链路转义"
  },
  {
    b2: "0001 0001",
    b8: "021",
    b10: "17",
    b16: "0x11",
    summ: "DC1 (device control 1)",
    expl: "设备控制1"
  },
  {
    b2: "0001 0010",
    b8: "022",
    b10: "18",
    b16: "0x12",
    summ: "DC2 (device control 2)",
    expl: "设备控制2"
  },
  {
    b2: "0001 0011",
    b8: "023",
    b10: "19",
    b16: "0x13",
    summ: "DC3 (device control 3)",
    expl: "设备控制3"
  },
  {
    b2: "0001 0100",
    b8: "024",
    b10: "20",
    b16: "0x14",
    summ: "DC4 (device control 4)",
    expl: "设备控制4"
  },
  {
    b2: "0001 0101",
    b8: "025",
    b10: "21",
    b16: "0x15",
    summ: "NAK (negative acknowledge)",
    expl: "拒绝接收"
  },
  {
    b2: "0001 0110",
    b8: "026",
    b10: "22",
    b16: "0x16",
    summ: "SYN (synchronous idle)",
    expl: "同步空闲"
  },
  {
    b2: "0001 0111",
    b8: "027",
    b10: "23",
    b16: "0x17",
    summ: "ETB (end of trans. block)",
    expl: "结束传输块"
  },
  {
    b2: "0001 1000",
    b8: "030",
    b10: "24",
    b16: "0x18",
    summ: "CAN (cancel)",
    expl: "取消"
  },
  {
    b2: "0001 1001",
    b8: "031",
    b10: "25",
    b16: "0x19",
    summ: "EM (end of medium)",
    expl: "媒介结束"
  },
  {
    b2: "0001 1010",
    b8: "032",
    b10: "26",
    b16: "0x1A",
    summ: "SUB (substitute)",
    expl: "代替"
  },
  {
    b2: "0001 1011",
    b8: "033",
    b10: "27",
    b16: "0x1B",
    summ: "ESC (escape)",
    expl: "换码(溢出)"
  },
  {
    b2: "0001 1100",
    b8: "034",
    b10: "28",
    b16: "0x1C",
    summ: "FS (file separator)",
    expl: "文件分隔符"
  },
  {
    b2: "0001 1101",
    b8: "035",
    b10: "29",
    b16: "0x1D",
    summ: "GS (group separator)",
    expl: "分组符"
  },
  {
    b2: "0001 1110",
    b8: "036",
    b10: "30",
    b16: "0x1E",
    summ: "RS (record separator)",
    expl: "记录分隔符"
  },
  {
    b2: "0001 1111",
    b8: "037",
    b10: "31",
    b16: "0x1F",
    summ: "US (unit separator)",
    expl: "单元分隔符"
  },
  {
    b2: "0010 0000",
    b8: "040",
    b10: "32",
    b16: "0x20",
    summ: "(space)",
    expl: "空格"
  },
  {
    b2: "0010 0001",
    b8: "041",
    b10: "33",
    b16: "0x21",
    summ: "!",
    expl: "叹号"
  },
  {
    b2: "0010 0010",
    b8: "042",
    b10: "34",
    b16: "0x22",
    summ: `"`,
    expl: "双引号"
  },
  {
    b2: "0010 0011",
    b8: "043",
    b10: "35",
    b16: "0x23",
    summ: "#",
    expl: "井号"
  },
  {
    b2: "0010 0100",
    b8: "044",
    b10: "36",
    b16: "0x24",
    summ: "$",
    expl: "美元符"
  },
  {
    b2: "0010 0101",
    b8: "045",
    b10: "37",
    b16: "0x25",
    summ: "%",
    expl: "百分号"
  },
  {
    b2: "0010 0110",
    b8: "046",
    b10: "38",
    b16: "0x26",
    summ: "&",
    expl: "和号"
  },
  {
    b2: "0010 0111",
    b8: "047",
    b10: "39",
    b16: "0x27",
    summ: `'`,
    expl: "闭单引号"
  },
  {
    b2: "0010 1000",
    b8: "050",
    b10: "40",
    b16: "0x28",
    summ: "(",
    expl: "开括号"
  },
  {
    b2: "0010 1001",
    b8: "051",
    b10: "41",
    b16: "0x29",
    summ: ")",
    expl: "闭括号"
  },
  {
    b2: "0010 1010",
    b8: "052",
    b10: "42",
    b16: "0x2A",
    summ: "*",
    expl: "星号"
  },
  {
    b2: "0010 1011",
    b8: "053",
    b10: "43",
    b16: "0x2B",
    summ: "+",
    expl: "加号"
  },
  {
    b2: "0010 1100",
    b8: "054",
    b10: "44",
    b16: "0x2C",
    summ: ",",
    expl: "逗号"
  },
  {
    b2: "0010 1101",
    b8: "055",
    b10: "45",
    b16: "0x2D",
    summ: "-",
    expl: "减号/破折号"
  },
  {
    b2: "0010 1110",
    b8: "056",
    b10: "46",
    b16: "0x2E",
    summ: ".",
    expl: "	句号"
  },
  {
    b2: "0010 1111",
    b8: "057",
    b10: "47",
    b16: "0x2F",
    summ: "/",
    expl: "斜杠"
  },
  {
    b2: "0011 0000",
    b8: "060",
    b10: "48",
    b16: "0x30",
    summ: "0",
    expl: "字符0"
  },
  {
    b2: "0011 0001",
    b8: "061",
    b10: "49",
    b16: "0x31",
    summ: "1",
    expl: "字符1"
  },
  {
    b2: "0011 0010",
    b8: "062",
    b10: "50",
    b16: "0x32",
    summ: "2",
    expl: "字符2"
  },
  {
    b2: "0011 0011",
    b8: "063",
    b10: "51",
    b16: "0x33",
    summ: "3",
    expl: "字符3"
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
  {
    b2: "",
    b8: "",
    b10: "",
    b16: "",
    summ: "",
    expl: ""
  },
]

 export default ASCII
